%=== Завдання #2.1 ===
% Завантаження сигналу ЕЕГ файл (eeg1-p4.dat)
fs = 
eeg = 
eeg = 
t = 
figure()
...

%=== Завдання #2.2 ===
% Виділення епохи сигналу ЕЕГ від t1 = 4,7 с до t2 = 5,8 с
t1 =  
t2 = 
n1 = 
n2 = 
eeg1 = 
figure()
...

%=== Завдання #2.3 ===
% Обчислення незміщеної оцінки АКФ сигналу ЕЕГ
...

%=== Завдання #2.4 ===
% Обчислення середнього періоду та середньої частоти
 
%=== Завдання #2.5 ===
% Обчислення спектральної щільності сигналу
Sy = fft(...);
N = length(..);
f = 
figure()
...

%=== Завдання #2.6 ===
% Завантаження сигналу ЕЕГ файл (eeg1-f3.dat)
fs = 
eeg = 
eeg = 
t = 
figure()
...

% Виділення епохи сигналу ЕЕГ від t1 = 4,2 с до t2 = 4,96 с
t1 =  
t2 = 
n1 = 
n2 = 
eeg1 = 
figure()
...

% Обчислення незміщеної оцінки АКФ сигналу ЕЕГ
...

% Обчислення середнього періоду та середньої частоти

% Обчислення спектральної щільності сигналу
...
