function lab05_main
%=== Дисципліна: Основи обробки біомедичної інформації ===
%--- Лабораторна робота #5 КОРЕЛЯЦІЙНИЙ АНАЛІЗ БІОСИГНАЛІВ
%
% Використовуйте файли даних: 
%   eeg1-c3.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-f3.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-f4.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-p3.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-p4.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-o2.dat - сигнал ЕЕГ, fs = 100 Гц
%----------------------------------------------------------

clear, clc, close all
disp('Лабораторна робота #5')
disp('КОРЕЛЯЦІЙНИЙ АНАЛІЗ БІОСИГНАЛІВ')
disp('Виконав:  , група ... ННІІДС')

%=== Завдання #1.1 ===
% Моделювання стаціонарного випадкового процесу
fs = 200;
f0 = 5;
A = 0.5;
D = 0.25;
n = 1000;
t = (0:(n-1))/fs; % вектор часу
s = A*cos(2*pi*f0*t);
v = randn(size(t))*sqrt(D);
x = s + v;

% Графіки отриманих сигналів
figure(1)
y = filter(v, s, x);
subplot(3, 1, 1), plot(t, x);
title('Сигнал'); 
ylim([-2 2]); 
ylabel('Амплітуда');
subplot(3, 1, 2), plot(t, s);
title('Сигнал без шуму'); ylabel('Амплітуда')
subplot(3, 1, 3), plot(t, v);
title('Шум'); xlabel('t'); ylabel('Амплітуда');