
%=== Завдання #3.1 ===
% Завантаження сигналу ЕЕГ файл (eeg1-o2.dat)
...

% Завантаження сигналу ЕЕГ файл (eeg1-c3.dat)
...

%=== Завдання #3.2 ===
% Виділення епохи сигналів ЕЕГ від t1 = 5,71 с до t2 = 6,78 с
t1 = 
t2 = 
n1 = 
n2 = 
eege1 = 
eege2 = 
figure()
subplot(2,1,1)
...

%=== Завдання #3.3 ===
% Обчислення ВКФ сигналів ЕЕГ
...

%=== Завдання #3.4 ===
% Обчислення взаємної спектральної щільності сигналів ЕЕГ
...

%=== Завдання #3.5 ===
% Завантаження сигналу ЕЕГ файл (eeg1-p3.dat)
...

% Завантаження сигналу ЕЕГ файл (eeg1-p4.dat)
...
 
% Виділення епохи сигналів ЕЕГ від t1 = 4,7 с до t2 = 5,8 с
...

% Обчислення ВКФ сигналів ЕЕГ
...

% Обчислення взаємної спектральної щільності сигналів ЕЕГ
...

%=== Завдання #3.6 ===
% Завантаження сигналу ЕЕГ файл (eeg1-f3.dat)
...

% Завантаження сигналу ЕЕГ файл (eeg1-f4.dat)
...

% Виділення епохи сигналів ЕЕГ від t1 = 4,13 с до t2 = 4,96 с t3 = 1,43 с до t4 = 2,26 с
...

% Обчислення ВКФ сигналів ЕЕГ
...

% Обчислення взаємної спектральної щільності сигналів ЕЕГ
...