function lab05_main
%=== Дисципліна: Основи обробки біомедичної інформації ===
%--- Лабораторна робота #5 КОРЕЛЯЦІЙНИЙ АНАЛІЗ БІОСИГНАЛІВ
%
% Використовуйте файли даних: 
%   eeg1-c3.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-f3.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-f4.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-p3.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-p4.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-o2.dat - сигнал ЕЕГ, fs = 100 Гц
%----------------------------------------------------------

clear, clc, close all
disp('Лабораторна робота #5')
disp('КОРЕЛЯЦІЙНИЙ АНАЛІЗ БІОСИГНАЛІВ')
disp('Виконав:  , група ... ННІІДС')

%=== Завдання #1.1 ===
% Моделювання стаціонарного випадкового процесу
fs = 200;
f0 = 5;
A = 0.5;
D = 0.25;
n = 1000;
t = (0:(n-1))/fs; % вектор часу
s = A*cos(2*pi*f0*t);
v = randn(size(t))*sqrt(D);
x = s + v;

% Графіки отриманих сигналів
figure(1)
y = filter(v, s, x);
subplot(3, 1, 1), plot(t, x);
title('Сигнал'); 
ylim([-2 2]); 
ylabel('Амплітуда');
subplot(3, 1, 2), plot(t, s);
title('Сигнал без шуму'); ylabel('Амплітуда')
subplot(3, 1, 3), plot(t, v);
title('Шум'); xlabel('Час'); ylabel('Амплітуда');

%=== Завдання #1.2 ===
% Обчислення оцінки дисперсії шуму, дисперсії сигналу та відношення шум/сигнал
fprintf('Математичне сподівання сигналу без шуму = %4.3g\n', mean(s))
fprintf('Дисперсія сигналу без шуму = %4.3g\n', var(s))
fprintf('Дисперсія шуму = %4.3g\n', var(v))
fprintf('Математичне сподівання сигналу = %4.3g\n', mean(x))
fprintf('Дисперсія сигналу = %4.3g\n', var(x))

%=== Завдання #1.3 ===
% Обчислення незміщеної оцінки АКФ змодельованого процесу  
maxlag = fix(0.2*length(x));
[r, lags] = xcorr(x, maxlag, 'unbiased');
figure(2)
plot(lags, r); title('Незміщена АКФ змодельованого процесу');
xlim([-5 5]);

%=== Завдання #1.4 ===
% Обчислення зміщеної оцінки АКФ змодельованого процесу  
maxlag2 = fix(0.8*length(x));
[r2, lags2] = xcorr(x, maxlag2, 'biased');
figure(3)
plot(lags2, r2); title('Зміщена АКФ змодельованого процесу');
xlim([-5 5]);
